app/views/trees/about.html.erb

SELECT  `contents`.* FROM `contents` WHERE (area = 'About') ORDER BY `contents`.`id` ASC LIMIT 1
---
<% about = Content.where("area = ?", "About").first %>