app/views/carts/_shopping_cart.html.erb

        <%= current_user.province_id %>
        <% province = Province.where("id = ?", "#{current_user.province_id}").first%>
---
SELECT  `provinces`.* FROM `provinces` WHERE (id = '11') ORDER BY `provinces`.`id` ASC LIMIT 1