app/controllers/order_items_controller.rb

SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
INSERT INTO `order_items` (`tree_id`, `order_id`, `unit_price`, `quantity`, `total_price`, `created_at`, `updated_at`) VALUES (2, 1, 149.99, 1, 149.99, '2016-11-15 18:51:53', '2016-11-15 18:51:53')
INSERT INTO `orders` (`subtotal`, `order_status_id`, `created_at`, `updated_at`) VALUES (149.99, 1, '2016-11-15 18:51:53', '2016-11-15 18:51:53')
---
  def create
    @order = current_order
    @order_item = @order.order_items.new(order_item_params)
    @order.save

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 AND `order_items`.`id` = 1 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
UPDATE `order_items` SET `quantity` = 2, `total_price` = 299.98, `updated_at` = '2016-11-15 19:07:33' WHERE `order_items`.`id` = 1
---
  def update
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.update_attributes(order_item_params)

SELECT  `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1 AND `order_items`.`id` = 1 LIMIT 1
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `order_items` WHERE `order_items`.`id` = 1
---
  def destroy
    @order = current_order
    @order_item = @order.order_items.find(params[:id])
    @order_item.destroy