app/controllers/trees_controller.rb

SELECT `trees`.* FROM `trees`
SELECT `order_items`.* FROM `order_items` WHERE `order_items`.`order_id` = 1
---
  def index
    @trees = Tree.all
    @order_item = current_order.order_items.new

SELECT  `trees`.* FROM `trees` WHERE `trees`.`id` = 1 LIMIT 1
---
  def set_tree
    @tree = Tree.find(params[:id])